# StructuralElementDefinitionData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData Class
Members See Also
---
Class containing information about section and position of the structural element.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralElementDefinitionData : IDisposable
```

Visual Basic
---
```text
Public Class StructuralElementDefinitionData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class StructuralElementDefinitionData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralElementDefinitionData
# See Also
StructuralElementDefinitionData Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace